Catalogs/НастройкиКатегорийНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>НастройкиКатегорийНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантЗаполненияМинимальнойЕдиницыОтпуска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыЗаполненияЕдиницыИзмеренияЛекарственнойФормы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантЗаполненияОсновнойЕдиницыУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыЗаполненияЕдиницыИзмеренияЛекарственнойФормы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецПартий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиКатегорийНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецСерий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиКатегорийНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаБухгалтерскогоУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыБухгалтерскогоУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПКУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПКУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретРедактированияНаименованияДляПечатиНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретРедактированияРабочегоНаименованияНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКоличествоСерии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьНомерСерии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПартии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСерии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСрокГодностиСерии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойствСерий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаИспользованияСерий</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НастройкиИспользованияСерийНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиПартийБерутсяИзДругихНастроекКатегорийНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиСерийБерутсяИзДругихНастроекКатегорийНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКПД2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОКПД2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолитикаУчетаПартий</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПолитикУчетаПартий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолитикаУчетаПартийВОтделениях</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПолитикУчетаПартий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолитикаУчетаСерий</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПолитикУчетаСерий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолитикаУчетаСерийВОтделениях</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПолитикУчетаСерий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатурыРасширенный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыНоменклатурыРасширенные</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочностьУказанияСрокаГодностиСерии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТочностиУказанияСрокаГодности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеноваяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонНаименованияДляПечатиНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонРабочегоНаименованияНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонРабочегоНаименованияСерии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСтеллажнойКарточки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныЭтикетокИЦенников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЦенника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныЭтикетокИЦенников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЭтикетки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныЭтикетокИЦенников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/НастройкиИспользованияСерийНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>НастройкиИспользованияСерийНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеИспользовать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭкземплярТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПартияТоваров</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыПолитикУчетаСерий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыПолитикУчетаСерий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СправочноеУказаниеСерий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеОстаткамиСерий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчетСебестоимостиПоСериям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУчитывать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыПолитикУчетаПартий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыПолитикУчетаПартий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УправлениеОстаткамиПартий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчетСебестоимостиПоПартиям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУчитывать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/НастройкиКатегорийНоменклатуры/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	
	Если Не Справочники.ГруппыДоступаНоменклатуры.ИспользуютсяГруппыДоступа() Тогда
		НепроверяемыеРеквизиты.Добавить("ГруппаДоступа");
	КонецЕсли;
	
	Если ИспользоватьСерии Тогда
		
		Если Не ИспользоватьСрокГодностиСерии Тогда
			НепроверяемыеРеквизиты.Добавить("ТочностьУказанияСрокаГодностиСерии");
		КонецЕсли;
		
		Если Не НастройкиСерийБерутсяИзДругихНастроекКатегорийНоменклатуры Тогда
			НепроверяемыеРеквизиты.Добавить("ВладелецСерий");
		КонецЕсли;
		
	Иначе
		НепроверяемыеРеквизиты.Добавить("ТочностьУказанияСрокаГодностиСерии");
		НепроверяемыеРеквизиты.Добавить("ПолитикаУчетаСерий");
		НепроверяемыеРеквизиты.Добавить("ПолитикаУчетаСерийВОтделениях");
		НепроверяемыеРеквизиты.Добавить("ВладелецСерий");
	КонецЕсли;
	
	Если ИспользоватьПартии Тогда
		
		Если Не НастройкиПартийБерутсяИзДругихНастроекКатегорийНоменклатуры Тогда
			НепроверяемыеРеквизиты.Добавить("ВладелецПартий");
		КонецЕсли;
		
	Иначе
		НепроверяемыеРеквизиты.Добавить("ПолитикаУчетаПартий");
		НепроверяемыеРеквизиты.Добавить("ПолитикаУчетаПартийВОтделениях");
		НепроверяемыеРеквизиты.Добавить("ВладелецПартий");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ШаблонНаименованияДляПечатиНоменклатуры = Метаданные().Реквизиты.ШаблонНаименованияДляПечатиНоменклатуры.ЗначениеЗаполнения;
	ШаблонРабочегоНаименованияНоменклатуры = "";
	ЗапретРедактированияРабочегоНаименованияНоменклатуры = Ложь;
	ЗапретРедактированияНаименованияДляПечатиНоменклатуры = Ложь;
	
	ШаблонРабочегоНаименованияСерии = "";
	
	Если ОбъектКопирования.ИспользоватьСерии Тогда
		Если Не ОбъектКопирования.НастройкиСерийБерутсяИзДругихНастроекКатегорийНоменклатуры Тогда
			НастройкиСерийБерутсяИзДругихНастроекКатегорийНоменклатуры = Истина;
			ВладелецСерий = ОбъектКопирования.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Если ОбъектКопирования.ИспользоватьПартии Тогда
		Если Не ОбъектКопирования.НастройкиПартийБерутсяИзДругихНастроекКатегорийНоменклатуры Тогда
			НастройкиПартийБерутсяИзДругихНастроекКатегорийНоменклатуры = Истина;
			ВладелецПартий = ОбъектКопирования.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Товар Тогда
		ИспользоватьСерии = Ложь;
		ИспользоватьПартии = Ложь;
	КонецЕсли;
	
	Если Не ИспользоватьСерии Тогда
		ИспользоватьНомерСерии = Ложь;
		ИспользоватьСрокГодностиСерии = Ложь;
		ИспользоватьКоличествоСерии = Ложь;
		ТочностьУказанияСрокаГодностиСерии = Перечисления.ТочностиУказанияСрокаГодности.ПустаяСсылка();
		НастройкаИспользованияСерий = Перечисления.НастройкиИспользованияСерийНоменклатуры.НеИспользовать;
		ПолитикаУчетаСерий = Перечисления.ТипыПолитикУчетаСерий.НеУчитывать;
		ПолитикаУчетаСерийВОтделениях = Перечисления.ТипыПолитикУчетаСерий.НеУчитывать;
		НастройкиСерийБерутсяИзДругихНастроекКатегорийНоменклатуры = Ложь;
		ВладелецСерий = Справочники.НастройкиКатегорийНоменклатуры.ПустаяСсылка();
	Иначе
		Если НастройкиСерийБерутсяИзДругихНастроекКатегорийНоменклатуры
		   И Не ДополнительныеСвойства.Свойство("ПропуститьЗаполнениеПоДругимНастройкамКатегорийНоменклатуры") Тогда
			
			Запрос = Новый Запрос("
			|ВЫБРАТЬ
			|	НастройкиКатегорийНоменклатуры.НастройкаИспользованияСерий         КАК НастройкаИспользованияСерий,
			|	НастройкиКатегорийНоменклатуры.ТочностьУказанияСрокаГодностиСерии  КАК ТочностьУказанияСрокаГодностиСерии,
			|	НастройкиКатегорийНоменклатуры.ПолитикаУчетаСерий                  КАК ПолитикаУчетаСерий,
			|	НастройкиКатегорийНоменклатуры.ПолитикаУчетаСерийВОтделениях       КАК ПолитикаУчетаСерийВОтделениях,
			|	НастройкиКатегорийНоменклатуры.ИспользоватьНомерСерии              КАК ИспользоватьНомерСерии,
			|	НастройкиКатегорийНоменклатуры.ИспользоватьСрокГодностиСерии       КАК ИспользоватьСрокГодностиСерии
			|ИЗ
			|	Справочник.НастройкиКатегорийНоменклатуры КАК НастройкиКатегорийНоменклатуры
			|ГДЕ
			|	НастройкиКатегорийНоменклатуры.Ссылка = &ВладелецСерий
			|");
			
			Запрос.УстановитьПараметр("ВладелецСерий", ВладелецСерий);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
			КонецЕсли;
			
		КонецЕсли;
		
		ИспользоватьКоличествоСерии = (НастройкаИспользованияСерий = Перечисления.НастройкиИспользованияСерийНоменклатуры.ПартияТоваров);
		
		Если Не ИспользоватьСрокГодностиСерии Тогда
			ТочностьУказанияСрокаГодностиСерии = Перечисления.ТочностиУказанияСрокаГодности.ПустаяСсылка();
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не НастройкиСерийБерутсяИзДругихНастроекКатегорийНоменклатуры Тогда
		ВладелецСерий = Справочники.НастройкиКатегорийНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	Если Не ИспользоватьПартии Тогда
		ПолитикаУчетаПартий = Перечисления.ТипыПолитикУчетаПартий.НеУчитывать;
		ПолитикаУчетаПартийВОтделениях = Перечисления.ТипыПолитикУчетаПартий.НеУчитывать;
		НастройкиПартийБерутсяИзДругихНастроекКатегорийНоменклатуры = Ложь;
		ВладелецПартий = Справочники.НастройкиКатегорийНоменклатуры.ПустаяСсылка();
	Иначе
		Если НастройкиПартийБерутсяИзДругихНастроекКатегорийНоменклатуры
		   И Не ДополнительныеСвойства.Свойство("ПропуститьЗаполнениеПоДругимНастройкамКатегорийНоменклатуры") Тогда
			
			Запрос = Новый Запрос("
			|ВЫБРАТЬ
			|	НастройкиКатегорийНоменклатуры.ПолитикаУчетаПартий            КАК ПолитикаУчетаПартий,
			|	НастройкиКатегорийНоменклатуры.ПолитикаУчетаПартийВОтделениях КАК ПолитикаУчетаПартийВОтделениях
			|ИЗ
			|	Справочник.НастройкиКатегорийНоменклатуры КАК НастройкиКатегорийНоменклатуры
			|ГДЕ
			|	НастройкиКатегорийНоменклатуры.Ссылка = &ВладелецПартий
			|");
			
			Запрос.УстановитьПараметр("ВладелецПартий", ВладелецПартий);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Если Не НастройкиПартийБерутсяИзДругихНастроекКатегорийНоменклатуры Тогда
		ВладелецПартий = Справочники.НастройкиКатегорийНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый"                                       , ЭтоНовый());
	ДополнительныеСвойства.Вставить("ИспользоватьСерии"                              , Ложь);
	ДополнительныеСвойства.Вставить("НастройкиСерийБерутсяИзДругихНастроекКатегорийНоменклатуры" , Ложь);
	ДополнительныеСвойства.Вставить("ИспользоватьПартии"                             , Ложь);
	ДополнительныеСвойства.Вставить("НастройкиПартийБерутсяИзДругихНастроекКатегорийНоменклатуры", Ложь);
	
	ДополнительныеСвойства.Вставить("ОтменаПометкиУдаления", Ложь);
	
	Если Не ЭтоНовый() Тогда
		
		ЗапрашиваемыеРеквизиты = Новый Структура;
		ЗапрашиваемыеРеквизиты.Вставить("ИспользоватьСерии");
		ЗапрашиваемыеРеквизиты.Вставить("НастройкиСерийБерутсяИзДругихНастроекКатегорийНоменклатуры");
		ЗапрашиваемыеРеквизиты.Вставить("ИспользоватьПартии");
		ЗапрашиваемыеРеквизиты.Вставить("НастройкиПартийБерутсяИзДругихНастроекКатегорийНоменклатуры");
		ЗапрашиваемыеРеквизиты.Вставить("ПометкаУдаления");
		
		СтарыеРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, ЗапрашиваемыеРеквизиты);
		ЗаполнитьЗначенияСвойств(ДополнительныеСвойства, СтарыеРеквизиты);
		
		Если Не ПометкаУдаления И СтарыеРеквизиты.ПометкаУдаления Тогда
			ДополнительныеСвойства.ОтменаПометкиУдаления = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьСвязанныеНастройкиКатегорийНоменклатуры();
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

//////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьСвязанныеНастройкиКатегорийНоменклатуры()
	
	Если ДополнительныеСвойства.ЭтоНовый Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.ИспользоватьСерии
	   И Не ДополнительныеСвойства.НастройкиСерийБерутсяИзДругихНастроекКатегорийНоменклатуры Тогда
		ОбновитьНастройкиСерийВСвязанныхНастройкахКатегорийНоменклатуры();
	КонецЕсли;
	
	Если ДополнительныеСвойства.ИспользоватьПартии
	   И Не ДополнительныеСвойства.НастройкиПартийБерутсяИзДругихНастроекКатегорийНоменклатуры Тогда
		ОбновитьНастройкиПартийВСвязанныхНастройкахКатегорийНоменклатуры();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьНастройкиСерийВСвязанныхНастройкахКатегорийНоменклатуры()
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	НастройкиКатегорийНоменклатуры.Ссылка КАК НастройкаКатегорийНоменклатуры
	|ИЗ
	|	Справочник.НастройкиКатегорийНоменклатуры КАК НастройкиКатегорийНоменклатуры
	|ГДЕ
	|	НастройкиКатегорийНоменклатуры.ВладелецСерий = &ВладелецСерий
	|");
	
	Запрос.УстановитьПараметр("ВладелецСерий", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ИзменяемыйОбъект = Выборка.НастройкаКатегорийНоменклатуры.ПолучитьОбъект();
		
		ИзменяемыйОбъект.ИспользоватьСерии = ИспользоватьСерии;
		Если Не ИспользоватьСерии Тогда
			ИзменяемыйОбъект.НастройкиСерийБерутсяИзДругихНастроекКатегорийНоменклатуры = Ложь;
			// Остальные поля очистятся при записи
			ИзменяемыйОбъект.Записать();
			Продолжить;
		КонецЕсли;
		
		ИзменяемыйОбъект.НастройкаИспользованияСерий = НастройкаИспользованияСерий;
		ИзменяемыйОбъект.ТочностьУказанияСрокаГодностиСерии = ТочностьУказанияСрокаГодностиСерии;
		ИзменяемыйОбъект.ИспользоватьНомерСерии             = ИспользоватьНомерСерии;
		ИзменяемыйОбъект.ИспользоватьСрокГодностиСерии      = ИспользоватьСрокГодностиСерии;
		ИзменяемыйОбъект.ПолитикаУчетаСерий = ПолитикаУчетаСерий;
		ИзменяемыйОбъект.ПолитикаУчетаСерийВОтделениях = ПолитикаУчетаСерийВОтделениях;
		
		// Остальные поля заполнятся при записи
		ИзменяемыйОбъект.ДополнительныеСвойства.Вставить("ПропуститьЗаполнениеПоДругимНастройкамКатегорийНоменклатуры");
		
		ИзменяемыйОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьНастройкиПартийВСвязанныхНастройкахКатегорийНоменклатуры()
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	НастройкиКатегорийНоменклатуры.Ссылка КАК НастройкаКатегорийНоменклатуры
	|ИЗ
	|	Справочник.НастройкиКатегорийНоменклатуры КАК НастройкиКатегорийНоменклатуры
	|ГДЕ
	|	НастройкиКатегорийНоменклатуры.ВладелецПартий = &ВладелецПартий
	|");
	
	Запрос.УстановитьПараметр("ВладелецПартий", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ИзменяемыйОбъект = Выборка.НастройкаКатегорийНоменклатуры.ПолучитьОбъект();
		
		ИзменяемыйОбъект.ИспользоватьПартии = ИспользоватьПартии;
		Если Не ИспользоватьПартии Тогда
			ИзменяемыйОбъект.НастройкиПартийБерутсяИзДругихНастроекКатегорийНоменклатуры = Ложь;
			// Остальные поля очистятся при записи
			ИзменяемыйОбъект.Записать();
			Продолжить;
		КонецЕсли;
		
		ИзменяемыйОбъект.ПолитикаУчетаПартий = ПолитикаУчетаПартий;
		ИзменяемыйОбъект.ПолитикаУчетаПартийВОтделениях = ПолитикаУчетаПартийВОтделениях;
		
		// Остальные поля заполнятся при записи
		ИзменяемыйОбъект.ДополнительныеСвойства.Вставить("ПропуститьЗаполнениеПоДругимНастройкамКатегорийНоменклатуры");
		
		ИзменяемыйОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции

#КонецЕсли
